const img = "./imgs/update4.png";
const img2 = "./imgs/update4.png";
const img3 = "./imgs/update4.png";

type product = {
  id: string;
  name: string;
  des: string;
  price: number;
  priceType: string;
  numOfDownloads: number;
  platforms: string[];
  cover: string;
};

export const ProductsData: product[] = [
  {
    id: "1",
    name: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسام المعهد...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios", "win"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/LOGO-205x200.png",
  },
  {
    id: "2",
    name: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/11231-205x200.jpg",
  },
  {
    id: "3",
    name: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2021/02/148-205x200.jpg",
  },
  {
    id: "4",
    name: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/11231-205x200.jpg",
  },
  {
    id: "5",
    name: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2021/02/148-205x200.jpg",
  },
  {
    id: "1",
    name: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسام المعهد...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios", "win"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/LOGO-205x200.png",
  },
  {
    id: "2",
    name: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/11231-205x200.jpg",
  },
  {
    id: "3",
    name: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2021/02/148-205x200.jpg",
  },
  {
    id: "4",
    name: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2022/07/11231-205x200.jpg",
  },
  {
    id: "5",
    name: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    price: 100,
    priceType: "month",
    numOfDownloads: 156,
    platforms: ["android", "ios"],
    cover: "https://iraqs.net/web/wp-content/uploads/2021/02/148-205x200.jpg",
  },
];

type updatesProps = {
  id: string;
  title: string;
  des: string;
  date: string;
  cover: string;
};

export const updates: updatesProps[] = [
  {
    id: "1",
    date: "منذ اسبوع",
    title: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسام المعهد...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "2",
    date: "منذ اسبوع",
    title: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "3",
    date: "منذ اسبوع",
    title: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "4",
    date: "منذ اسبوع",
    title: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعلأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقساملأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقساملأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك امع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسلبرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسام المعهد...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "5",
    date: "منذ اسبوع",
    title: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihak1zQGuVPbdXHKv5BhjRCOWfxxB4KCC-6AqEWPKjOultJpOg9LM2JeKpCmBoIqALZdMEw3Vuqb10V11-G1xHQl2weAYTYJvg=w5120-h1296-rw-v1`,
  },
  {
    id: "6",
    date: "منذ اسبوع",
    title: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihak1zQGuVPbdXHKv5BhjRCOWfxxB4KCC-6AqEWPKjOultJpOg9LM2JeKpCmBoIqALZdMEw3Vuqb10V11-G1xHQl2weAYTYJvg=w5120-h1296-rw-v1`,
  },
  {
    id: "1",
    date: "منذ اسبوع",
    title: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسام المعهد...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "2",
    date: "منذ اسبوع",
    title: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "3",
    date: "منذ اسبوع",
    title: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "4",
    date: "منذ اسبوع",
    title: "دقة لادارة المعاهد",
    des: "لأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعلأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقساملأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقساملأدارة حسابات المعاهد بدت فترة الدراسة الصيفية للطلاب والان مع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك امع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسمع برنامج دقة الجديد لإدارة المعاهد الخصوصية يقدم لك البرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسلبرنامج مميزات عديدة اهمها: • تعدد كروبات طلاب • تعدد اقسامدد كروبات طلاب • تعدد اقسام المعهد...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihZO8J5zSP0wCZqqucLEF756eyYeAD5oYksZdvXSWRU0-AVH1WXsalJQAWY-qfjEAhS5it7vytx0m642JRKH0vP0WE99Ex-qtA=w5120-h970-rw-v1`,
  },
  {
    id: "5",
    date: "منذ اسبوع",
    title: "حسابات الابراج",
    des: "التطبيق الاول من نوعه لأدارة حسابات أبراج الانترنت مع مزامنة مباشرة لشركات الانترنت .. طباعة فواتير .. كشف حساب للفواتير الاجلة .. تسديد جزئي او كلي للديون .. كل هذا..",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihak1zQGuVPbdXHKv5BhjRCOWfxxB4KCC-6AqEWPKjOultJpOg9LM2JeKpCmBoIqALZdMEw3Vuqb10V11-G1xHQl2weAYTYJvg=w5120-h1296-rw-v1`,
  },
  {
    id: "6",
    date: "منذ اسبوع",
    title: "KoK market",
    des: "تطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق علتطبيق عراقي متوفر في العراق و لبنان يجمع افكارمتعددة للتطبيقات جميعها في تطبيق واحد حيث يحتوي التطبيق على: 1- دليل للمحلات التجارية والاعمال التجارية مع معلومات لكل محل تجاري 2-البحث...",
    cover: `https://lh3.googleusercontent.com/u/0/drive-viewer/AKGpihak1zQGuVPbdXHKv5BhjRCOWfxxB4KCC-6AqEWPKjOultJpOg9LM2JeKpCmBoIqALZdMEw3Vuqb10V11-G1xHQl2weAYTYJvg=w5120-h1296-rw-v1`,
  },
];
